app/controllers/students_controller.rb

  def update
    @student = Student.find(params[:id])
    @student.update(student_params(:title))
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Lindsey"], ["last_name", "Stirling"], ["updated_at", "2019-02-06 23:01:25.556793"], ["id", 1]]